<details><summary> for projects_test1_environments_devel 2024-05-30 11:31:30 (UTC)</summary>
    <details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # aws_s3_bucket.example will be created
  + resource "aws_s3_bucket" "example" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "my-tf-test-bucket2"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "devel"
          + "Name"        = "My bucket devel"
        }
      + tags_all                    = {
          + "Environment" = "devel"
          + "Name"        = "My bucket devel"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```
</details>

<details><summary>Terraform plan validation check (projects_test1_environments_devel)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>